### Terraform Plan:
```
[0m[1maws_security_group.example: Refreshing state... [id=sg-0954367191803e0a8][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
[31m-[0m/[32m+[0m destroy and then create replacement
[0m
Terraform will perform the following actions:

[1m  # aws_security_group.example[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_security_group" "example" {
      [33m~[0m [0m[1m[0marn[0m[0m                    = "arn:aws:ec2:us-east-1:788932519567:security-group/sg-0954367191803e0a8" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mdescription[0m[0m            = "Terraform security group" [33m->[0m [0m"Terra security group" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mid[0m[0m                     = "sg-0954367191803e0a8" [33m->[0m [0m(known after apply)
        [1m[0mname[0m[0m                   = "terra-security-group"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m            = (known after apply)
      [33m~[0m [0m[1m[0mowner_id[0m[0m               = "788932519567" [33m->[0m [0m(known after apply)
        [1m[0mtags[0m[0m                   = {
            "Name" = "example-security-group"
        }
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 1 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [33m~[0m [0m[1m[0msecurity_group_id[0m[0m = "sg-0954367191803e0a8" [33m->[0m [0m(known after apply)
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

Plan saved to GH artifacts.